In [2]:
from grab_db import my_db
import numpy as np
import pandas as pd

In [28]:
zillow = my_db('''select bathroomcnt, bedroomcnt, calculatedfinishedsquarefeet, taxvaluedollarcnt, yearbuilt, taxamount, fips
 from properties_2017
 join propertylandusetype
 using(propertylandusetypeid)
 where(propertylandusetypeid = 261);''','zillow')

In [29]:
zillow

,bathroomcnt,bedroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,2.0,4.0,3633.0,296425.0,2005.0,6941.39,6037.0
...,...,...,...,...,...,...,...
2152858,3.0,4.0,2262.0,960756.0,2015.0,13494.52,6059.0
2152859,4.5,4.0,3127.0,536061.0,2014.0,6244.16,6059.0
2152860,0.0,0.0,NaN,208057.0,NaN,5783.88,6059.0
2152861,2.5,3.0,1974.0,424353.0,2015.0,5302.70,6059.0
2152862,4.0,4.0,2110.0,554009.0,2014.0,6761.20,6037.0

In [30]:
#making zillow equal to all rows that arent all null
zillow1 = zillow[zillow.isnull().sum(axis = 1) < len(zillow.columns)]

In [31]:

zillow1[zillow1.isna().any(axis=1)]

,bathroomcnt,bedroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
5,0.0,0.0,NaN,124.0,NaN,NaN,6037.0
...,...,...,...,...,...,...,...
2152823,0.0,0.0,NaN,2568893.0,NaN,27309.30,6059.0
2152844,0.0,0.0,NaN,92679.0,NaN,1090.16,6111.0
2152854,0.0,0.0,NaN,1198476.0,NaN,NaN,6037.0
2152857,0.0,0.0,NaN,1087111.0,NaN,19313.08,6059.0
2152860,0.0,0.0,NaN,208057.0,NaN,5783.88,6059.0

In [32]:
# we can impute all nulls in yearbuilt to 0 where there are no bedrooms and bathrooms as this means that there is likely nothing built.
zillow1.yearbuilt[(zillow1.bathroomcnt == 0.0) & (zillow1.bedroomcnt == 0.0)] = zillow1.yearbuilt[(zillow1.bathroomcnt == 0) & (zillow1.bedroomcnt == 0.0)].fillna(0)

In [33]:
zillow1[zillow1.isna().any(axis=1)]

,bathroomcnt,bedroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,27516.0,0.0,NaN,6037.0
1,0.0,0.0,NaN,10.0,0.0,NaN,6037.0
2,0.0,0.0,NaN,10.0,0.0,NaN,6037.0
3,0.0,0.0,NaN,2108.0,0.0,174.21,6037.0
5,0.0,0.0,NaN,124.0,0.0,NaN,6037.0
...,...,...,...,...,...,...,...
2152823,0.0,0.0,NaN,2568893.0,0.0,27309.30,6059.0
2152844,0.0,0.0,NaN,92679.0,0.0,1090.16,6111.0
2152854,0.0,0.0,NaN,1198476.0,0.0,NaN,6037.0
2152857,0.0,0.0,NaN,1087111.0,0.0,19313.08,6059.0
2152860,0.0,0.0,NaN,208057.0,0.0,5783.88,6059.0

In [34]:
zillow1.calculatedfinishedsquarefeet[zillow1.yearbuilt == 0.0] = zillow1.calculatedfinishedsquarefeet[zillow1.yearbuilt == 0.0].replace(np.nan,0)

In [35]:
zillow1.calculatedfinishedsquarefeet[zillow1.yearbuilt == 0.0].replace(np.nan,0)

0          0.0
1          0.0
2          0.0
3          0.0
5          0.0
          ...
2152823    0.0
2152844    0.0
2152854    0.0
2152857    0.0
2152860    0.0
Name: calculatedfinishedsquarefeet, Length: 8065, dtype: float64

In [36]:
zillow1[zillow1.isna().any(axis=1)]

,bathroomcnt,bedroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,0.0,27516.0,0.0,NaN,6037.0
1,0.0,0.0,0.0,10.0,0.0,NaN,6037.0
2,0.0,0.0,0.0,10.0,0.0,NaN,6037.0
5,0.0,0.0,0.0,124.0,0.0,NaN,6037.0
10,0.0,0.0,0.0,11009.0,0.0,NaN,6037.0
...,...,...,...,...,...,...,...
2150217,1.0,2.0,NaN,73360.0,NaN,1786.28,6059.0
2151358,1.5,2.0,1482.0,169038.0,1954.0,NaN,6059.0
2152488,2.0,3.0,992.0,104040.0,2001.0,NaN,6037.0
2152503,1.0,3.0,1894.0,179732.0,NaN,NaN,6037.0
2152854,0.0,0.0,0.0,1198476.0,0.0,NaN,6037.0

In [37]:
zillow1 = zillow1.drop(columns = 'taxamount')

In [38]:
zillow1 = zillow1.dropna()

In [39]:
zillow1

,bathroomcnt,bedroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,fips
0,0.0,0.0,0.0,27516.0,0.0,6037.0
1,0.0,0.0,0.0,10.0,0.0,6037.0
2,0.0,0.0,0.0,10.0,0.0,6037.0
3,0.0,0.0,0.0,2108.0,0.0,6037.0
4,2.0,4.0,3633.0,296425.0,2005.0,6037.0
...,...,...,...,...,...,...
2152858,3.0,4.0,2262.0,960756.0,2015.0,6059.0
2152859,4.5,4.0,3127.0,536061.0,2014.0,6059.0
2152860,0.0,0.0,0.0,208057.0,0.0,6059.0
2152861,2.5,3.0,1974.0,424353.0,2015.0,6059.0
2152862,4.0,4.0,2110.0,554009.0,2014.0,6037.0